{
  "backend/main.mo": "Defines backend actor with access-controlled storage for user profiles and timeline configurations, including save and load operations.",
  "feature_evidence.json": "Lists feature reports describing implemented audio-layer, export, and persistence functionalities with associated files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files involved in trailer building, audio handling, and UI components.",
  "frontend/index.css": "Defines base Tailwind layers and custom CSS variables for light and dark themes with color and layout settings.",
  "frontend/index.html": "Basic HTML entry point setting up the root div and loading the main React module.",
  "frontend/src/App.tsx": "Wraps the main trailer builder page in theme and toaster providers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates related queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, stored identity restoration, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profiles and timeline configurations through the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styling with custom color variables and serif typography for dark-themed UI.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider, rendering App into the root element.",
  "frontend/src/pages/TrailerBuilderPlayerPage.tsx": "Main trailer builder page managing segment state, playback, audio sync, recording, and UI layout.",
  "frontend/src/trailer/assets.ts": "Maps scene and overlay identifiers to image asset paths.",
  "frontend/src/trailer/audioTracks.ts": "Defines available audio tracks for trailers and exports the default track.",
  "frontend/src/trailer/SceneTimelinePanel.tsx": "Renders a timeline with a scrubber and editable segment durations, highlighting the active segment.",
  "frontend/src/trailer/scriptDefault.ts": "Defines the TrailerSegment interface and provides the default ordered trailer script.",
  "frontend/src/trailer/TrailerAudioControls.tsx": "UI controls for enabling audio, selecting a track, and adjusting volume.",
  "frontend/src/trailer/TrailerRendererCanvas.tsx": "Canvas renderer that preloads assets and draws the current trailer frame with overlays, text, and effects.",
  "frontend/src/trailer/typography.ts": "Functions to draw title cards and cinematic captions with fade and layout logic.",
  "frontend/src/trailer/useAudioSettingsPersistence.ts": "Hook that loads and saves audio settings to localStorage.",
  "frontend/src/trailer/useTimelinePersistence.ts": "Loads and saves trailer timeline segments to localStorage and exposes them via a React hook.",
  "frontend/src/trailer/useTrailerAudio.ts": "Manages an HTMLAudioElement with track selection, volume/enabled settings, sync, and playback control.",
  "frontend/src/trailer/useTrailerExportRecorder.ts": "Captures canvas output (optionally with mixed audio) into a WebM video using MediaRecorder and manages recording state.",
  "frontend/src/trailer/useTrailerPlayback.ts": "Implements trailer playback timing with play, pause, seek, and reset, tracking current time via requestAnimationFrame.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Describes the project’s state, features, and versions for an IC app with a React trailer builder frontend and Motoko backend."
}